Documents/ЗаявкаНаОбеспечение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаОбеспечение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаОбеспечение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбеспечиваетсяЗакупкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджетов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Протокол</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаявокНаОбеспечение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыЗаявокНаОбеспечение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаОбеспечение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВыполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаОбеспечение/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	#Область ИнтегрируемыеПодсистемы
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	#КонецОбласти
	
	ПараметрыВыбораСтатейИАналитик = Документы.ЗаявкаНаОбеспечение.ПараметрыВыбораСтатейИАналитик(Объект.ОбеспечиваетсяЗакупкой);
	ДоходыИРасходыСервер.ПриЧтенииНаСервере(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	#Область ИнтегрируемыеПодсистемы
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ШтрихкодыИТорговоеОборудование
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтотОбъект);
	// Конец ШтрихкодыИТорговоеОборудование
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// Обработчик механизма "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	УстановитьДоступностьКомандБуфераОбмена(ЭтотОбъект, РаботаСТабличнымиЧастями.ЕстьСтрокиВБуфереОбмена());
	
	ПараметрыВыбораСтатейИАналитик = Документы.ЗаявкаНаОбеспечение.ПараметрыВыбораСтатейИАналитик(Объект.ОбеспечиваетсяЗакупкой);
	ДоходыИРасходыСервер.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	#КонецОбласти
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	АктивироватьСтрокуЕдинственнойПозиции();
	
	#Область ИнтегрируемыеПодсистемы
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(
		Неопределено,
		ЭтотОбъект,
		"СканерШтрихкода");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	#Область ИнтегрируемыеПодсистемы
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	#КонецОбласти
	
	// Переопределяем проверку в модуле объекта:
	НепроверяемыеРеквизиты.Добавить("Объект"); 
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ДополнительныеСвойства.Вставить("ОднаПозиция", ОднаПозиция(ЭтотОбъект));
	
	Если Не ДокументОбъект.ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПараметрыЗаписи.РежимЗаписи = ЗначениеИзКэша(КэшФормы, "РежимЗаписи");
	ПараметрыЗаписи.Вставить("ИнтерактивнаяЗапись", Истина);
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	#Область ИнтегрируемыеПодсистемы
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	#Область ИнтегрируемыеПодсистемы
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
		
	СобытияФорм.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	#КонецОбласти
	
	ЗаполнитьДанныеФормы();
	
	ДоходыИРасходыСервер.ПослеЗаписиНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	АктивироватьСтрокуЕдинственнойПозиции();
	Оповестить("Запись_ЗаявкаНаОбеспечение", ПараметрыЗаписи, Объект.Ссылка);
	
	#Область ИнтегрируемыеПодсистемы
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	
	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ПринудительноЗакрытьФорму = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	#Область ИнтегрируемыеПодсистемы
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	#Область ИнтегрируемыеПодсистемы
	
	// ПодключаемоеОборудование
	Если ВводДоступен()
		И Источник = "ПодключаемоеОборудование" Тогда
		
		Если ИмяСобытия = "ScanData"
			И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр));
			
		КонецЕсли;
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// Неизвестные штрихкоды
	Если ИмяСобытия = "НеизвестныеШтрихкоды"
		И Источник = "ПодключаемоеОборудование"
		И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
		
		КэшированныеЗначения.Штрихкоды.Очистить();
		
		ДанныеШтрихкодов = Новый Массив;
		
		Для Каждого ПолученныйШтрихкод Из Параметр.ШтрихкодыНоменклатуры Цикл
			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
		КонецЦикла;
		
		ОбработатьШтрихкоды(ДанныеШтрихкодов);
		
	КонецЕсли;
	
	// Обработчик механизма "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
	Если ИмяСобытия = "КопированиеСтрокВБуферОбмена" Тогда
		
		УстановитьДоступностьКомандБуфераОбмена(ЭтотОбъект, Истина);
		
	КонецЕсли;
	
	СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	УстановитьКонтрольАссортиментаВКэше(КэшФормы,
		Объект.Дата,
		Объект.Склад);
		
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		Объект.Валюта = ВалютаДокумента;
		
		Возврат;
	КонецЕсли;
	
	ПересчитатьСуммы = ЦенообразованиеКлиент.НеобходимПересчетВВалюту(Объект, ВалютаДокумента);
	ВалютаПриИзмененииНаСервере(Объект.Валюта, ПересчитатьСуммы);
	
	ЦенообразованиеКлиент.ОповеститьОбОкончанииПересчетаСуммВВалюту(ВалютаДокумента, Объект.Валюта);
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	УстановитьКонтрольАссортиментаВКэше(КэшФормы,
		Объект.Дата,
		Объект.Склад);
		
КонецПроцедуры

&НаКлиенте
Процедура ПереключательТоваровПриИзменении(Элемент)
	
	Если Объект.Товары.Количество() = 0 Тогда
		// Таблица может быть пустой только при работе с несколькими позициями.
		// При переключении необходимо добавить строку и спозиционироваться на ней:
		Элементы.Товары.ТекущаяСтрока = Объект.Товары.Добавить().ПолучитьИдентификатор();
	КонецЕсли;
	
	Если Объект.Товары.Количество() > 1
		И ПереключательТоваров = Элементы.СтраницаТовар.Имя Тогда
		
		ПереключательТоваров = Элементы.СтраницаТоварыТаблица.Имя;
		ПоказатьПредупреждение(, НСтр("ru = 'Переключение в режим одной позиции невозможен, если введено более одного товара.'"));
		Возврат;
		
	КонецЕсли;
	
	УстановитьСтраницуТоваров(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечиваетсяЗакупкойПриИзменении(Элемент)
	ОбеспечиваетсяЗакупкойПриИзмененииНаСервере();
КонецПроцедуры

#Область Протокол

&НаКлиенте
Процедура ПредставлениеСтатусаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	РаботаСПротоколомДокументаКлиент.ОбработатьНавигационнуюСсылкуПротокола(
		ЭтотОбъект,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеИсполнителяОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	РаботаСПротоколомДокументаКлиент.ОбработатьНавигационнуюСсылкуПротокола(
		ЭтотОбъект,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

//@skip-check module-structure-form-event-regions -- Обработчики едины как для одного товара, так и для перечня
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	СтруктураДействий = Новый Структура;
	ДобавитьДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтотОбъект);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьЦенуЗаУпаковку", ТекущиеДанные.Количество);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	ПараметрыРасчетаЦены = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВЗакупкахВТЧ(
		Объект,
		Истина); // Отключение ручных скидок
	СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВЗакупках", ПараметрыРасчетаЦены);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтатьяРасходовПриИзменении(Элемент)
	
	// Выбор статей и аналитик.
	ДоходыИРасходыКлиентСервер.СтатьяПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтатьяРасходовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	// Выбор статей и аналитик.
	ДоходыИРасходыКлиент.НачалоВыбораСтатьи(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#Область НоменклатураСтрокой

&НаКлиенте
Процедура ТоварыНоменклатураСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		Возврат; // Не выводим весь список или сообщение <"" не найдено> (если уже что-то введено)
	КонецЕсли;
	
	// Имитация ввода текста в поле ввода с типом "СправочникСсылка.Номенклатура":
	ДанныеВыбора = ДанныеВыбораНоменклатуры(ПараметрыПолученияДанных.СтрокаПоиска);
	
	// Если данных нет, то не сбрасываем стандартную обработку, чтобы не выводить пользователю "не найдено".
	Если ЗначениеЗаполнено(ДанныеВыбора) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", ОтборНоменклатуры());
	ПараметрыОткрытия.Вставить("ТекущаяСтрока", Элементы.Товары.ТекущиеДанные.Номенклатура);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора",
		ПараметрыОткрытия,
		Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
		
	УстановитьЗначениеВКэше(КэшФормы, "ИмяСобытияИзмененияНоменклатуры", "ОкончаниеВводаТекста");
	Элементы.Товары.ТекущиеДанные.НоменклатураСтрокой = Текст; // Для поля ввода единственного товара необходимо явно устанавливать значение.

КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураСтрокойОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, ТекущиеДанные.Номенклатура);
		
	ИначеЕсли ПустаяСтрока(Элемент.ТекстРедактирования) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли ЗначениеИзКэша(КэшФормы, "НоменклатураДобавление") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ТекстЗаполнения", Элемент.ТекстРедактирования);
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ОтборНоменклатуры());
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
		
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ПараметрыОткрытия, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураСтрокойОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	// Пользователь выбрал значение из списка / формы выбора / создал новый элемент:
	Если Не НоменклатураСоответствуетПараметрамВыбора(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, НСтр("ru = 'Выбранное значение не соответствует условиям выбора'"));
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Номенклатура = ВыбранноеЗначение;
	УстановитьЗначениеВКэше(КэшФормы, "ИмяСобытияИзмененияНоменклатуры", "ОбработкаВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураСтрокойПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	// Обрабатываем события, которые не допускают серверных вызовов:
	ИмяСобытияИзмененияНоменклатуры = ЗначениеИзКэша(КэшФормы, "ИмяСобытияИзмененияНоменклатуры");
	Если ИмяСобытияИзмененияНоменклатуры = "ОкончаниеВводаТекста" Тогда

		УстанавливаемаяНоменклатура = Неопределено;
		ДанныеВыбораНоменклатуры = ДанныеВыбораНоменклатуры(ТекущиеДанные.НоменклатураСтрокой);
		Если ДанныеВыбораНоменклатуры.Количество() = 1 Тогда
			// Возможно, текст совпадает с наименованием номенклатуры:
			Номенклатура = ДанныеВыбораНоменклатуры[0].Значение.Значение;
			ПредставлениеНоменклатуры = НоменклатураСтрокой(
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Номенклатура)).Получить(Номенклатура);
			
			Если Врег(ПредставлениеНоменклатуры) = ВРег(ТекущиеДанные.НоменклатураСтрокой) Тогда
				
				УстанавливаемаяНоменклатура = Номенклатура;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТекущиеДанные.Номенклатура = УстанавливаемаяНоменклатура;
		
	КонецЕсли;
	
	ПриИзмененииНоменклатуры(ТекущиеДанные);
	УстановитьЗначениеВКэше(КэшФормы, "ИмяСобытияИзмененияНоменклатуры", "");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ЗаписьДокумента

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ЗаписатьИЗакрыть(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаленияДокумента(Команда)
	
	ОбщегоНазначенияУТКлиент.УстановитьПометкуУдаленияДокумента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ВидыЦен
 
&НаКлиенте
Процедура ЗаполнитьЦеныПоВидуЦен(Команда)

	Если Не ПроверитьНаличиеВыделенныхСтрок() Тогда
		Возврат;
	КонецЕсли;

	Если Не ВЕдинственнойПозицииЗаполненаНоменклатура() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для заполнения цены необходимо выбрать номенклатуру из справочника'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЦеныПредприятияЗаполнениеКлиент.НеобходимоЗаполнениеЦенПоВидуЦен(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыВыбораЦен = ЦеныПредприятияЗаполнениеКлиент.НовыйПараметрыЗаполненияВыбратьВидЦен();
	ПараметрыВыбораЦен.ОписаниеОповещения = ОписаниеОповещенияОВыбореВидаЦены(Ложь);
		
	ЦеныПредприятияЗаполнениеКлиент.ВыбратьВидЦен(ПараметрыВыбораЦен);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПоВидуЦеныПоставщика(Команда)
	
	Если Не ПроверитьНаличиеВыделенныхСтрок() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ВЕдинственнойПозицииЗаполненаНоменклатура() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для заполнения цены необходимо выбрать номенклатуру из справочника'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЦеныПартнеровЗаполнениеКлиент.НеобходимоЗаполнениеЦенПоВидуЦенПоставщика(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = ОписаниеОповещенияОВыбореВидаЦены(Истина);
	
	ЦеныПартнеровЗаполнениеКлиент.ВыбратьВидЦеныПоставщика(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти
 
#Область КоммерческиеПредложения

&НаКлиенте
Процедура НачатьЗаполнениеЦенПоКоммерческимПредложениям(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьНаличиеВыделенныхСтрок() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗаполнения = ЗаполнитьЦеныПоКоммерческимПредложениям(Элементы.Товары.ВыделенныеСтроки);
	
	ОднаПозиция = ОднаПозиция(ЭтотОбъект);
	
	Для Каждого НомерСтрокиТоваров Из РезультатЗаполнения.НомераСтрокСНезаполненнымиУсловиямиЗакупки Цикл
		
		Если ОднаПозиция Тогда
			
			ТекстОшибки = НСтр("ru = 'Не удалось заполнить цену. Проверьте соответствие номенклатуры в заявке и запросе коммерческого предложения'");
			
			ПутьКЭлементу = ОбщегоНазначенияУТКлиентСервер.ПутьКЭлементуТекущейСтрокиТаблицыФормы(
				"Товары",
				"Цена");
				
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ТекстОшибки,
				,// При выводе ошибки в "элемент" нельзя указать объект.
				ПутьКЭлементу);
				
		Иначе
			
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Для строки %1 списка ""Товары"" не найдена цена в выбранных коммерческих предложениях.'"),
				НомерСтрокиТоваров);
				
			ПутьКЭлементу = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"Объект.Товары",
				НомерСтрокиТоваров,
				"Цена");
				
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ТекстОшибки,
				,
				ПутьКЭлементу);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если РезультатЗаполнения.Отказ Тогда
		
		ПоказатьПредупреждение(, РезультатЗаполнения.ТекстОшибки);
		
	ИначеЕсли Не ОднаПозиция(ЭтотОбъект) Тогда
		
		КоличествоНеобработанныхСтрок = РезультатЗаполнения.НомераСтрокСНезаполненнымиУсловиямиЗакупки.Количество();
		
		ЕстьЗаполненныеСтроки = Элементы.Товары.ВыделенныеСтроки.Количество() > КоличествоНеобработанныхСтрок;
		Если ЕстьЗаполненныеСтроки Тогда
			ТекстСообщения = НСтр("ru = 'Цены заполнены.'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Не удалось заполнить цены.'");
		КонецЕсли;
		
		ТекстПояснения = СтрШаблон(НСтр("ru = 'Цены заполнены в %1 из %2 строк.'"),
			Элементы.Товары.ВыделенныеСтроки.Количество() - КоличествоНеобработанныхСтрок,
			Элементы.Товары.ВыделенныеСтроки.Количество());
			
		ПоказатьОповещениеПользователя(ТекстСообщения,, ТекстПояснения, БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтегрируемыеПодсистемы

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ОчиститьСообщения();
	ОборудованиеТерминалыСбораДанныхКлиент.НачатьЗагрузкуДанныеИзТСД(
		Новый ОписаниеОповещения("ЗагрузитьИзТСДЗавершение", ЭтотОбъект),
		УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти

#Область Свойства

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область РаботаСБуферомОбмена

&НаКлиенте
Процедура ВставитьСтроки(Команда)
	
	КоличествоТоваровДоВставки = Объект.Товары.Количество();
	
	ПолучитьСтрокиИзБуфераОбмена();
	
	КоличествоВставленных = Объект.Товары.Количество() - КоличествоТоваровДоВставки;
	РаботаСТабличнымиЧастямиКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоВставленных);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтроки(Команда)
	
	Если РаботаСТабличнымиЧастямиКлиент.ВыбранаСтрокаДляВыполненияКоманды(Элементы.Товары) Тогда
		СкопироватьСтрокиНаСервере();
		РаботаСТабличнымиЧастямиКлиент.ОповеститьПользователяОКопированииСтрок(Элементы.Товары.ВыделенныеСтроки.Количество());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбеспечиваетсяЗакупкойПриИзмененииНаСервере()
	
	ОтображатьРеквизитыЗакупки = Документы.ЗаявкаНаОбеспечение.ОтображатьРеквизитыЗакупки(Объект);
	
	УстановитьЗначениеВКэше(КэшФормы,
		"ОтображатьРеквизитыЗакупки",
		ОтображатьРеквизитыЗакупки);
	
	
	ПараметрыВыбораСтатей = Документы.ЗаявкаНаОбеспечение.ПараметрыВыбораСтатейИАналитик(Объект.ОбеспечиваетсяЗакупкой);
	ДоходыИРасходыСервер.ПриИзмененииПараметровВыбораСтатей(ЭтотОбъект, ПараметрыВыбораСтатей);
	
	Если ОтображатьРеквизитыЗакупки И Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		// Не перезаполняем, если раннее пользователь уже указал значение при работе с формой и перевыбирает значение флага.
		Объект.Валюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Объект.Организация);
	КонецЕсли;
	
	Если ОтображатьРеквизитыЗакупки И Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		// Повторная попытка заполнения валюты, в случае, если организация не заполнена.
		Объект.Валюта = ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию();
	КонецЕсли;
	
	ВалютаДокумента = Объект.Валюта;
	
	ОформитьПоляОбеспеченияЗакупкой();
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере(НоваяВалюта, ПересчитатьСуммы)
	
	Если ПересчитатьСуммы Тогда
		ВыполнитьПересчетСуммДокумента(ВалютаДокумента, НоваяВалюта);
	КонецЕсли;
	
	ВалютаДокумента = Объект.Валюта;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПересчетСуммДокумента(СтараяВалюта, НоваяВалюта)
	
	Если СтараяВалюта <> НоваяВалюта Тогда
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму");
		
		ДатаДокумента = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
		БазоваяВалюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Объект.Организация);
		СтруктураКурсовСтаройВалюты = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(СтараяВалюта, ДатаДокумента, БазоваяВалюта);
		СтруктураКурсовНовойВалюты  = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(НоваяВалюта,  ДатаДокумента, БазоваяВалюта);
		
		Для Каждого ТекСтрока Из Объект.Товары Цикл
			
			ТекСтрока.Цена = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(
				ТекСтрока.Цена,
				СтруктураКурсовСтаройВалюты,
				СтруктураКурсовНовойВалюты);
			
		КонецЦикла;
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(
			Объект.Товары,
			СтруктураДействий);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСтрокуЕдинственнойПозиции()
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница <> Элементы.СтраницаТовар Тогда 
		Возврат;
	КонецЕсли;
	
	Если Элементы.Товары.ТекущаяСтрока <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Товары) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Товары.ТекущаяСтрока = Объект.Товары.Получить(0).ПолучитьИдентификатор();
		
КонецПроцедуры

&НаКлиенте
Функция ПроверитьНаличиеВыделенныхСтрок(МножественныйРежимВыделения = Истина)
	
	ТекстПредупреждения = "";
	
	Если Объект.Товары.Количество() = 0 Тогда
		
		ТекстПредупреждения = НСтр("ru='Таблица товаров не заполнена.'");
		
	ИначеЕсли Элементы.Товары.ВыделенныеСтроки.Количество() = 0 Тогда
		
		Если МножественныйРежимВыделения Тогда
			ТекстПредупреждения = НСтр("ru='В таблице товаров отсутствуют выделенные строки.'");
		Иначе
			ТекстПредупреждения = НСтр("ru='Необходимо выделить строку товаров.'");
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверкаПройдена = ПустаяСтрока(ТекстПредупреждения);
	Если Не ПроверкаПройдена Тогда
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
	КонецЕсли;
	
	Возврат ПроверкаПройдена;
	
КонецФункции

&НаКлиенте
Функция ВЕдинственнойПозицииЗаполненаНоменклатура()
	
	Возврат Не ОднаПозиция(ЭтотОбъект)
		Или ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Номенклатура);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОднаПозиция(Форма)
	
	Возврат Форма.Элементы.ГруппаСтраницы.ТекущаяСтраница = Форма.Элементы.СтраницаТовар;
	
КонецФункции

#Область ВидыЦен

&НаКлиенте
Функция ОписаниеОповещенияОВыбореВидаЦены(ЭтоЗакупочныеЦены)
	Возврат Новый ОписаниеОповещения("ЗаполнитьЦеныПоВидуЦенЗавершение", ЭтотОбъект, ЭтоЗакупочныеЦены);
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЦеныПоВидуЦенЗавершение(ВидЦены, ЭтоЗакупочныеЦены) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ЦеныРассчитаны = Истина;
	ЗаполнитьЦеныПоВидуЦенСервер(ВидЦены, ЭтоЗакупочныеЦены);
	
	Если ЭтоЗакупочныеЦены Тогда
		ЦеныПартнеровЗаполнениеКлиент.ОповеститьОбОкончанииЗаполненияЦенПоВидуЦеныПоставщика(ЦеныРассчитаны, ВидЦены);
	Иначе
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, ВидЦены);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПоВидуЦенСервер(ВидЦены, ЭтоЗакупочныеЦены)
	
	ВыделенныеСтроки = Новый Массив;
	Для Каждого ИдентификаторСтроки Из Элементы.Товары.ВыделенныеСтроки Цикл
		СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
		ВыделенныеСтроки.Добавить(СтрокаТоваров);
	КонецЦикла;
	
	ОбъектСВидомЦены = Новый Структура;
	ОбъектСВидомЦены.Вставить("Дата", Объект.Дата);
	ОбъектСВидомЦены.Вставить("Организация", Объект.Организация);
	ОбъектСВидомЦены.Вставить("Валюта", Объект.Валюта);
	ОбъектСВидомЦены.Вставить("ВидЦены", ВидЦены);
	ОбъектСВидомЦены.Вставить("Партнер", Справочники.Партнеры.ПустаяСсылка());
	
	СтруктураДействий = Новый Структура;
	
	Если ЭтоЗакупочныеЦены Тогда
		
		ОбъектСВидомЦены.Партнер = Справочники.ВидыЦенПоставщиков.ВладелецВидаЦены(ВидЦены);
		ПараметрыЗаполнения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(
			ОбъектСВидомЦены,
			"ВидЦены");
			
		СтруктураДействий.Вставить("ЗаполнитьЦенуЗакупки", ПараметрыЗаполнения);
		
	Иначе
		
		ПараметрыЗаполнения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(
			ОбъектСВидомЦены,
			Истина);
		
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ПараметрыЗаполнения);
		
	КонецЕсли;
	
	СтруктураДействий.Вставить("ПересчитатьСумму");
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(ВыделенныеСтроки, СтруктураДействий, Объект.Товары);
	
КонецПроцедуры

#КонецОбласти

#Область КоммерческиеПредложения

&НаСервере
Функция ЗаполнитьЦеныПоКоммерческимПредложениям(Знач ИдентификаторыСтрок)
	
	НомераСтрок = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ИдентификаторыСтрок Цикл
		СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
		НомераСтрок.Добавить(СтрокаТоваров.НомерСтроки);
	КонецЦикла;
	
	ПараметрыЗаполнения = КоммерческиеПредложенияДокументыУТ.ПараметрыЗаполненияУсловийЗакупкиПоКоммерческимПредложениям();
	ПараметрыЗаполнения.Документ = Объект.Ссылка;
	ПараметрыЗаполнения.ДатаКурса = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	ПараметрыЗаполнения.Валюта = Объект.Валюта;
	
	ПараметрыЗаполнения.ЕстьНоменклатураСтрокой = Истина;
	ПараметрыЗаполнения.НомераСтрок = НомераСтрок;
	
	ПараметрыЗаполнения.ДействияСИзмененнымиСтроками.Вставить("ПересчитатьСумму");
	
	РезультатЗаполнения = КоммерческиеПредложенияДокументыУТ.ЗаполнитьУсловияЗакупкиПоКоммерческимПредложениям(Объект.Товары, ПараметрыЗаполнения);
	
	// Переключение страницы, если были добавлены новые строки:
	ЗаполнитьЗначениеПереключателяТоваров();
	УстановитьСтраницуТоваров(ЭтотОбъект);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Отказ", РезультатЗаполнения.Отказ);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки", РезультатЗаполнения.ТекстОшибки);
	ВозвращаемоеЗначение.Вставить("НомераСтрокСНезаполненнымиУсловиямиЗакупки", РезультатЗаполнения.НомераСтрокСНезаполненнымиУсловиямиЗакупки);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область Протокол

&НаКлиенте
Процедура Подключаемый_ПриИзмененииПротокола(ОписаниеИзменений, ДополнительныеПараметры = Неопределено) Экспорт
	
	СтатусПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	УстановитьРежимЗаписиВКэше();
	УправлениеФормой();
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

#Область ЗаписьДокумента

&НаСервере
Процедура УстановитьРежимЗаписиВКэше()
	
	УстановитьЗначениеВКэше(
		КэшФормы,
		"РежимЗаписи",
		Документы.ЗаявкаНаОбеспечение.РежимЗаписи(Объект));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщегоНазначенияУТКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НоменклатураСтрокой

&НаКлиенте
Функция ДанныеВыбораНоменклатуры(Знач СтрокаПоиска)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Отбор", ОтборНоменклатуры());
	ПараметрыПодбора.Вставить("СтрокаПоиска", СтрокаПоиска);
	
	Возврат ПолучитьДанныеВыбора(Тип("СправочникСсылка.Номенклатура"), ПараметрыПодбора);
	
КонецФункции

&НаСервереБезКонтекста
Функция НоменклатураСоответствуетПараметрамВыбора(Номенклатура)
	
	Отбор = ОтборНоменклатуры();
	ИменаРеквизитов = ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(Отбор, ",");
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, ИменаРеквизитов);
	
	ЕстьНесоответствие = Ложь;
	Для Каждого КлючИЗначение Из Отбор Цикл
		ИмяРеквизита = КлючИЗначение.Ключ;
		ЗначениеОтбора = КлючИЗначение.Значение;
		
		Если ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
			ЕстьНесоответствие = ЗначениеОтбора.Найти(ЗначенияРеквизитов[ИмяРеквизита]) = Неопределено;
		Иначе
			ЕстьНесоответствие = ЗначениеОтбора <> ЗначенияРеквизитов[ИмяРеквизита];
		КонецЕсли;
		
		Если ЕстьНесоответствие Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Не ЕстьНесоответствие;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОтборНоменклатуры()
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипНоменклатуры", НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТареУслугеРаботе(Ложь));
	
	Возврат Отбор;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(СтрокаТаблицы)
	
	ОчиститьСообщения();
	
	ЗаполнитьПризнакНоменклатураУказана(СтрокаТаблицы);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", СтрокаТаблицы.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", СтрокаТаблицы.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);
	
	ОформитьХарактеристикуТовара(ЭтотОбъект);
	ЗаполнитьПодсказкуЕдиницыИзмеренияТовара(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуруСтрокой(СтрокиКОбработке)
	
	Номенклатура = Объект.Товары.Выгрузить(СтрокиКОбработке).ВыгрузитьКолонку("Номенклатура");
	НоменклатураСтрокой = НоменклатураСтрокой(Номенклатура);
	
	Для Каждого СтрокаТоваров Из СтрокиКОбработке Цикл
		СтрокаТоваров.НоменклатураСтрокой = НоменклатураСтрокой.Получить(СтрокаТоваров.Номенклатура);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НоменклатураСтрокой(Номенклатура)

	ВозвращаемоеЗначение = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(Номенклатура.Ссылка) КАК НоменклатураСтрокой
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура ГДЕ Ссылка В (&Номенклатура)";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВозвращаемоеЗначение.Вставить(Выборка.Номенклатура, Выборка.НоменклатураСтрокой);
	КонецЦикла;

	Возврат ВозвращаемоеЗначение;

КонецФункции

#Область КартинкаНоменклатуры

&НаСервере
Процедура ОтметитьУказаннуюНоменклатуру()
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		ЗаполнитьПризнакНоменклатураУказана(СтрокаТовары);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПризнакНоменклатураУказана(СтрокаТаблицы)
	СтрокаТаблицы.НоменклатураУказана = ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура);	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область УправлениеФормой

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЗаполнитьЗначениеПереключателяТоваров(); // Не вызывается после записи, чтобы не переключать форму.
	ЗаполнитьДанныеФормы();
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
	// Используется как предыдущее значение и выводится даже при выключенной Ф.О. "ИспользоватьНесколькоВалют": 
	ВалютаДокумента = Объект.Валюта; 
	
	РаботаСПротоколомДокумента.ЗаполнитьДанныеФормы(ЭтотОбъект);
	
	ИнициализироватьКэшФормы();
	ОтметитьУказаннуюНоменклатуру();
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
		Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект);
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	ОформитьХарактеристикуТовара(ЭтотОбъект);
	ОформитьПоляЛимитов();
	ОформитьПоляОбеспеченияЗакупкой();
	УстановитьСтраницуТоваров(ЭтотОбъект);
	
	ПроверятьШапку = Перечисления.СтатусыЗаявокНаОбеспечение.Согласована(Объект.Статус);
	СвойстваШапки = Новый Структура;
	СвойстваШапки.Вставить("АвтоОтметкаНезаполненного", ПроверятьШапку);
	Если Не СвойстваШапки.АвтоОтметкаНезаполненного Тогда
		СвойстваШапки.Вставить("ОтметкаНезаполненного", Ложь);
	КонецЕсли;
	
	Для Каждого ИмяРеквизита Из Документы.ЗаявкаНаОбеспечение.ИменаРеквизитовШапки() Цикл
		УстановитьСвойстваРеквизита(ИмяРеквизита, СвойстваШапки);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваРеквизита(ИмяРеквизита, Свойства)
	
	ИменаЭлементов = Новый Массив;
	ПрефиксРеквизитаТабличнойЧасти = "Товары.";
	Если СтрНачинаетсяС(ИмяРеквизита, ПрефиксРеквизитаТабличнойЧасти) Тогда
		
		ИменаЭлементов.Добавить(СтрЗаменить(ИмяРеквизита, ПрефиксРеквизитаТабличнойЧасти, "Товар"));
		ИменаЭлементов.Добавить(СтрЗаменить(ИмяРеквизита, ПрефиксРеквизитаТабличнойЧасти, "Товары"));
		
	Иначе 
		
		ИменаЭлементов.Добавить(ИмяРеквизита);
		
	КонецЕсли;
	
	// Дубли элементов:
	Если ИмяРеквизита = "Валюта" Тогда
		ИменаЭлементов.Добавить(Элементы.ВалютаЛимиты.Имя);
	КонецЕсли;
	
	Для Каждого ИмяЭлемента Из ИменаЭлементов Цикл
		
		Элемент = Элементы.Найти(ИмяЭлемента);
		Если Элемент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Элемент, Свойства);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОформитьПоляОбеспеченияЗакупкой()
	
	Если Документы.ЗаявкаНаОбеспечение.ИспользоватьЛимитыБДР() Тогда
		// Валюта всегда отображается.
		Элементы.СтраницыОбеспечиваетсяЗакупкой.ТекущаяСтраница = Элементы.СтраницаОбеспечиваетсяЗакупкойЛимиты;
	Иначе
		Элементы.СтраницыОбеспечиваетсяЗакупкой.ТекущаяСтраница = Элементы.СтраницаОбеспечиваетсяЗакупкой;
	КонецЕсли;
	ИспользоватьЛимитыБДР = ЗначениеИзКэша(КэшФормы, "ИспользоватьЛимитыБДР");
	Элементы.НаправлениеДеятельности.Видимость = ИспользоватьЛимитыБДР;
	Элементы.ТоварСтатьяБюджетов.Видимость = ИспользоватьЛимитыБДР;
	Элементы.ТоварыСтатьяБюджетов.Видимость = ИспользоватьЛимитыБДР;
	
	Элементы.ОбеспечиваетсяЗакупкой.Заголовок = 
		?(Объект.ОбеспечиваетсяЗакупкой И ЗначениеИзКэша(КэшФормы, "ИспользоватьНесколькоВалют"),
		НСтр("ru = 'Обеспечивается закупкой в валюте:'"),
		НСтр("ru = 'Обеспечивается закупкой'"));
	
	СтатусыВидимостиКомандыЗаполнитьЦены = Новый Массив;
	СтатусыВидимостиКомандыЗаполнитьЦены.Добавить(Перечисления.СтатусыЗаявокНаОбеспечение.НаСогласовании);
	СтатусыВидимостиКомандыЗаполнитьЦены.Добавить(Перечисления.СтатусыЗаявокНаОбеспечение.НаВыполнении);
	
	ВидимостьЭлемента =
		ЗначениеИзКэша(КэшФормы, "ИспользоватьЗапросыКоммерческихПредложенийПоставщиков")
		И СтатусыВидимостиКомандыЗаполнитьЦены.Найти(Объект.Статус) <> Неопределено
		И Объект.ОбеспечиваетсяЗакупкой;
	
	Элементы.ТоварыЗаполнитьЦеныПоКоммерческимПредложениям.Видимость = ВидимостьЭлемента;
	Элементы.ТоварЗаполнитьЦеныПоКоммерческимПредложениям.Видимость = ВидимостьЭлемента;
	
	ПроверятьРеквизиты = Документы.ЗаявкаНаОбеспечение.ПроверятьРеквизитыЗакупки(Объект);
	ОтображатьРеквизиты = ЗначениеИзКэша(КэшФормы, "ОтображатьРеквизитыЗакупки");
	
	Элементы.ТоварЗаполнитьЦеныПоВидуЦен.Видимость = ОтображатьРеквизиты;
	Элементы.ТоварыЗаполнитьЦеныПоВидуЦен.Видимость = ОтображатьРеквизиты;
	Элементы.ТоварЗаполнитьЦеныПоВидуЦенПоставщика.Видимость = ОтображатьРеквизиты;
	Элементы.ТоварыЗаполнитьЦеныПоВидуЦенПоставщика.Видимость = ОтображатьРеквизиты;
	
	ИзменяемыеСвойства = Новый Структура;
	ИзменяемыеСвойства.Вставить("Видимость", ОтображатьРеквизиты); 
	ИзменяемыеСвойства.Вставить("АвтоОтметкаНезаполненного", ПроверятьРеквизиты);
	Если Не ИзменяемыеСвойства.АвтоОтметкаНезаполненного Тогда
		ИзменяемыеСвойства.Вставить("ОтметкаНезаполненного", Ложь);
	КонецЕсли;

	Для Каждого ИмяРеквизита Из Документы.ЗаявкаНаОбеспечение.ИменаРеквизитовЗакупки() Цикл
		УстановитьСвойстваРеквизита(ИмяРеквизита, ИзменяемыеСвойства);
	КонецЦикла;
	
	УстановитьВидимостьИтогов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОформитьПоляЛимитов()
	
	// Видимость полей регулируется функциональной опцией, изменяем только проверку значений:
	ПроверятьРеквизиты = Документы.ЗаявкаНаОбеспечение.ПроверятьРеквизитыАналитикЛимитирования(Объект);
	ИзменяемыеСвойства = Новый Структура; 
	ИзменяемыеСвойства.Вставить("АвтоОтметкаНезаполненного", ПроверятьРеквизиты);
	Если Не ИзменяемыеСвойства.АвтоОтметкаНезаполненного Тогда
		ИзменяемыеСвойства.Вставить("ОтметкаНезаполненного", Ложь);
	КонецЕсли;
	
	Для Каждого ИмяРеквизита Из Документы.ЗаявкаНаОбеспечение.ИменаРеквизитовАналитикЛимитирования() Цикл
		УстановитьСвойстваРеквизита(ИмяРеквизита, ИзменяемыеСвойства);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОформитьХарактеристикуТовара(Форма)
	
	ХарактеристикиИспользуются = Ложь;
	Если ЗначениеЗаполнено(Форма.Объект.Товары) Тогда
		ХарактеристикиИспользуются = Форма.Объект.Товары[0].ХарактеристикиИспользуются;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	Элементы.ТоварХарактеристика.АвтоОтметкаНезаполненного = ХарактеристикиИспользуются;
	Элементы.ТоварХарактеристика.ТолькоПросмотр = Не ХарактеристикиИспользуются;
	Если ХарактеристикиИспользуются Тогда
		Элементы.ТоварХарактеристика.ПодсказкаВвода = "";
	Иначе
		Элементы.ТоварХарактеристика.ПодсказкаВвода = НСтр("ru ='<характеристики не используются>'");
		Элементы.ТоварХарактеристика.ОтметкаНезаполненного = Ложь;
	КонецЕсли;

КонецПроцедуры

#Область ЕдиницаИзмерения

&НаКлиентеНаСервереБезКонтекста
// Есть серверный вызов!
Процедура ЗаполнитьПодсказкуЕдиницыИзмеренияТовара(Форма)
	
	Элементы = Форма.Элементы;
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТовар Тогда
		Элементы.ТоварУпаковка.ПодсказкаВвода = ПодсказкаЕдиницыИзмеренияТовара(Форма.Объект.Товары[0].Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодсказкаЕдиницыИзмеренияТовара(Номенклатура)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Номенклатура,
		Новый Структура("ЕдиницаИзмерения", "ЕдиницаИзмерения.Представление")).ЕдиницаИзмерения;
	
КонецФункции

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСтраницуТоваров(Форма)
	
	Элементы = Форма.Элементы;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Найти(Форма.ПереключательТоваров);
	УстановитьВидимостьИтогов(Форма);
	ЗаполнитьПодсказкуЕдиницыИзмеренияТовара(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьИтогов(Форма)
	
	Элементы = Форма.Элементы;
	ОтображатьСуммовыеИтоги = ЗначениеИзКэша(Форма.КэшФормы, "ОтображатьРеквизитыЗакупки")
		// Для одной строки итогом является сама строка:
		И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТоварыТаблица; 
		
	Элементы.ИтогСумма.Видимость = ОтображатьСуммовыеИтоги;
	Элементы.ВалютаНадпись.Видимость = ОтображатьСуммовыеИтоги;
	
КонецПроцедуры

#Область СтраницыТоваров

&НаСервере
Процедура ЗаполнитьЗначениеПереключателяТоваров()
	
	ПереключательТоваров = ?(Объект.Товары.Количество() = 1,
		Элементы.СтраницаТовар.Имя,
		Элементы.СтраницаТоварыТаблица.Имя);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область КэшФормы

&НаСервере
Процедура ИнициализироватьКэшФормы()

	КэшФормы = Новый Структура;
	
	УстановитьЗначениеВКэше(КэшФормы,
		"ИспользоватьНесколькоВалют",
		ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют"));
	
	УстановитьЗначениеВКэше(КэшФормы,
		"НоменклатураДобавление",
		ПравоДоступа("Добавление", Метаданные.Справочники.Номенклатура));
		
	УстановитьЗначениеВКэше(КэшФормы,
		"ИмяСобытияИзмененияНоменклатуры",
		"");
		
	УстановитьКонтрольАссортиментаВКэше(КэшФормы,
		Объект.Дата,
		Объект.Склад);
	
	ИспользоватьЛимитыБДР = Ложь; // Значение по умолчанию для УТ.
			
	УстановитьЗначениеВКэше(КэшФормы,
		"ИспользоватьЛимитыБДР",
		ИспользоватьЛимитыБДР);
	
	УстановитьЗначениеВКэше(КэшФормы,
		"ОтображатьРеквизитыЗакупки",
		Документы.ЗаявкаНаОбеспечение.ОтображатьРеквизитыЗакупки(Объект));
	
	УстановитьЗначениеВКэше(КэшФормы,
		"ИспользоватьЗапросыКоммерческихПредложенийПоставщиков",
		КоммерческиеПредложенияДокументыУТ.ИспользоватьЗапросыКоммерческихПредложенийПоставщиков());
	
	УстановитьРежимЗаписиВКэше();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗначениеВКэше(КэшФормы, ИмяСвойства, ЗначениеСвойства)
	
	Если Не КэшФормы.Свойство(ИмяСвойства) Тогда
		
		КэшФормы.Вставить(ИмяСвойства);
		
	КонецЕсли;
	
	КэшФормы[ИмяСвойства] = ЗначениеСвойства;
	
КонецПроцедуры

// Значение из кэша.
// 
// Параметры:
//  КэшФормы - Структура - Одноименный реквизит формы
//  ИмяСвойства - Строка - Имя свойства в кэше, установленное через "УстановитьЗначениеВКэше"
// 
// Возвращаемое значение:
//  Произвольный - Ранее сохраненное значение
&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеИзКэша(КэшФормы, ИмяСвойства)
	
	Возврат КэшФормы[ИмяСвойства];
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьКонтрольАссортиментаВКэше(КэшФормы, Дата, Склад)
	
	УстановитьЗначениеВКэше(КэшФормы,
		"КонтролироватьАссортимент",
		АссортиментСерверПовтИсп.КонтролироватьАссортимент(Склад, Дата));
	
КонецПроцедуры

#КонецОбласти

#Область ИнтегрируемыеПодсистемы

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(ДанныхШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТСДЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.Результат Тогда
		ОбработатьШтрихкоды(Результат.ТаблицаТоваров);
	Иначе
		МенеджерОборудованияУТКлиент.СообщитьОбОшибке(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	ОчиститьСообщения();
	
	Если Не ШтрихкодированиеНоменклатурыКлиент.ШтрихкодыВалидны(ДанныеШтрихкодов) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", 
		Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ДобавитьДействияПриИзмененииКоличестваУпаковок(СтруктураДействийСДобавленнымиСтроками, ЭтотОбъект);
	
	СтруктураДействийСИзмененнымиСтроками = Новый Структура;
	ДобавитьДействияПриИзмененииКоличестваУпаковок(СтруктураДействийСИзмененнымиСтроками, ЭтотОбъект);
	
	СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
	СтруктураДействий.Штрихкоды                              = ДанныеШтрихкодов;
	СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
	СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = СтруктураДействийСИзмененнымиСтроками;
	
	Если ЗначениеИзКэша(КэшФормы, "КонтролироватьАссортимент") Тогда
		ПараметрыПроверкиАссортимента = АссортиментКлиентСервер.ПараметрыПроверкиАссортимента();
		ПараметрыПроверкиАссортимента.Ссылка                  = Объект.Ссылка;
		ПараметрыПроверкиАссортимента.Склад                   = Объект.Склад;
		ПараметрыПроверкиАссортимента.Дата                    = Объект.Дата;
		ПараметрыПроверкиАссортимента.ИмяРесурсаАссортимента  = "РазрешеныЗакупки";
		ПараметрыПроверкиАссортимента.ПровереноМожноДобавлять = Истина;
		ПараметрыПроверкиАссортимента.РазрешатьДобавление     = Истина;
		ПараметрыПроверкиАссортимента.ТекстСообщения =
			НСтр("ru = 'Товар %1 не включен в ассортимент магазина. Заказывать его не рекомендуется.'");
		
		СтруктураДействий.ПараметрыПроверкиАссортимента = ПараметрыПроверкиАссортимента;
	КонецЕсли;
	
	ОбработатьШтрихкодыСервер(СтруктураДействий, КэшированныеЗначения);
	
	ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(СтруктураДействий,
		КэшированныеЗначения,
		ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(СтруктураПараметровДействия, КэшированныеЗначения)
	
	ИдентификаторыСтрокТоваров = ИдентификаторыСтрокТоваров();
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(
		ЭтотОбъект,
		Объект,
		СтруктураПараметровДействия,
		КэшированныеЗначения);
	
	ИдентификаторыДобавленныхСтрок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ИдентификаторыСтрокТоваров(),
		ИдентификаторыСтрокТоваров);
	
	ДобавленныеСтроки = Новый Массив;
	Для Каждого ИдентификаторДобавленнойСтроки Из ИдентификаторыДобавленныхСтрок Цикл
		
		СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторДобавленнойСтроки);
		ДобавленныеСтроки.Добавить(СтрокаТоваров);
		ЗаполнитьПризнакНоменклатураУказана(СтрокаТоваров);
		
	КонецЦикла;
	
	ЗаполнитьНоменклатуруСтрокой(ДобавленныеСтроки);
	
КонецПроцедуры

&НаСервере
Функция ИдентификаторыСтрокТоваров()
	
	ВозвращаемоеЗначение = Новый Массив;
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		ВозвращаемоеЗначение.Добавить(СтрокаТоваров.ПолучитьИдентификатор());
	КонецЦикла;
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область Свойства

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
		Команда,
		ЭтотОбъект,
		Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти

#Область РаботаСБуферомОбмена

&НаСервере
Процедура СкопироватьСтрокиНаСервере()
	
	РаботаСТабличнымиЧастями.СкопироватьСтрокиВБуферОбмена(Объект.Товары, Элементы.Товары.ВыделенныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтрокиИзБуфераОбмена()
	
	ПараметрыОтбора = Новый Соответствие;
	
	КолонкиБуфера = Новый Массив;
	КолонкиБуфера.Добавить("Номенклатура");
	КолонкиБуфера.Добавить("Характеристика");
	КолонкиБуфера.Добавить("Упаковка");
	КолонкиБуфера.Добавить("КоличествоУпаковок");
	КолонкиБуфера.Добавить("Цена");
	
	ТаблицаТоваров = РаботаСТабличнымиЧастями.СтрокиИзБуфераОбмена(ПараметрыОтбора, КолонкиБуфера);
	
	Если Не ЗначениеЗаполнено(ТаблицаТоваров) Тогда
		Возврат;
	КонецЕсли;
	
	ОбрабатываемыеСтроки = Новый Массив;
	Для Каждого СтрокаИсточник Из ТаблицаТоваров Цикл
		
		СтрокаТоваров = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТоваров, СтрокаИсточник);
		ЗаполнитьПризнакНоменклатураУказана(СтрокаТоваров);
		ОбрабатываемыеСтроки.Добавить(СтрокаТоваров);
		
	КонецЦикла;
	
	ЗаполнитьНоменклатуруСтрокой(ОбрабатываемыеСтроки);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", 
		Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ДобавитьДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтотОбъект);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		Объект.Товары);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандБуфераОбмена(Форма, ЗначениеДоступности)
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ТоварыВставитьСтроки");
	ИменаЭлементов.Добавить("ТоварыКонтекстноеМенюВставитьСтроки");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Форма.Элементы,
		ИменаЭлементов,
		"Доступность",
		ЗначениеДоступности);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПакетнаяОбработкаТабличнойЧасти

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Форма)
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
